src/InformationRegisters/дкл_Обработки/дкл_Обработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_Обработки</name>
  <resources>
    <name>ИмяОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отладка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогОтладки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВнутренняяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НастройкаВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВебСервисаДляКопии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.дкл_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.дкл_НаправлениеСообщения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_НаправлениеСообщения/дкл_НаправлениеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_НаправлениеСообщения</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/дкл_Обработки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачальноеЗаполнение(Команда)
	НачальноеЗаполнениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВременныхФайловОтОбработок(Команда)
	ОчиститьКаталогВременныхФайловОтОбработокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбработкиВКаталогеВременныхФайлов(Команда)
	ОбновитьОбработкиВКаталогеВременныхФайловНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальноеЗаполнениеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ТипыСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.дкл_ТипыСообщений КАК дкл_ТипыСообщений";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		МенеджерЗаписи = РегистрыСведений.дкл_Обработки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяОбработки = Строка(ВыборкаДетальныеЗаписи.Ссылка);
		МенеджерЗаписи.ВнутренняяОбработка = Истина;
		МенеджерЗаписи.Направление = Перечисления.дкл_НаправлениеСообщения.Исходящее;
		МенеджерЗаписи.ТипСообщения = ВыборкаДетальныеЗаписи.Ссылка;
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.дкл_Обработки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяОбработки = Строка(ВыборкаДетальныеЗаписи.Ссылка) + "In";
		МенеджерЗаписи.ВнутренняяОбработка = Истина;
		МенеджерЗаписи.Направление = Перечисления.дкл_НаправлениеСообщения.Входящее;
		МенеджерЗаписи.ТипСообщения = ВыборкаДетальныеЗаписи.Ссылка;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКаталогВременныхФайловОтОбработокНаСервере()
	КаталогОбработки = КаталогВременныхФайлов();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	дкл_Обработки.ИмяОбработки КАК ИмяОбработки
		|ИЗ
		|	РегистрСведений.дкл_Обработки КАК дкл_Обработки";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяФайла = дкл_Обработчики.ПолучитьИмяФайлаОбработки(
			ВыборкаДетальныеЗаписи.ИмяОбработки, КаталогОбработки);
		УдалитьФайлы(ИмяФайла);
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбработкиВКаталогеВременныхФайловНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	дкл_Обработки.ИмяОбработки КАК ИмяОбработки
		|ИЗ
		|	РегистрСведений.дкл_Обработки КАК дкл_Обработки";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.дкл_Обработки.ПодключитьОбработку(
			ВыборкаДетальныеЗаписи.ИмяОбработки, Перечисления.дкл_НаправлениеСообщения.Входящее);			
		РегистрыСведений.дкл_Обработки.ПодключитьОбработку(
			ВыборкаДетальныеЗаписи.ИмяОбработки, Перечисления.дкл_НаправлениеСообщения.Исходящее);			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
